Revit 2024 API
PanelScheduleView.GetSectionData Method
 Gets section data that will be written to
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TableSectionData GetSectionData(
	SectionType sectionType
)
Visual Basic
Public Function GetSectionData ( _
	sectionType As SectionType _
) As TableSectionData
Visual C++
public:
TableSectionData^ GetSectionData(
	SectionType sectionType
)
Parameters
sectionType
Type: Autodesk.Revit.DB.SectionType
 The section type
Return Value
 The TableSectionData
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace